In [2]:
import numpy as np
import pandas as pd

In [3]:
# 한 셀에서 여려 결과 출력
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [15]:
df = pd.DataFrame([['a', 'b', 'c'],
                   ['d', 'e', 'f'],
                   ['g', 'h', 'i'],
                   ['j', 'k', 'l'],
                   ],
                   index=['a', 'b', 'c', 'd'],
                   columns = ['A', 'B', 'C']                   
                   )
df
df["A"]["d"] # [열][행]
df.loc["d", "A"] # .loc[행, 열]

df[["A", "C"]]
df.loc[["a"], ["A", "C"]]

   A  B  C
a  a  b  c
b  d  e  f
c  g  h  i
d  j  k  l

'j'

'j'

   A  C
a  a  c
b  d  f
c  g  i
d  j  l

   A  C
a  a  c

In [26]:
idf = pd.DataFrame(np.arange(10, 30).reshape(5, 4),
                  index=[1, 2, 3, 4, 5],
                  columns = [1, 2, 3, 4])
# idf[0] # key 기반이 아니라 인식을 못함
idf.iloc[0]

1    10
2    11
3    12
4    13
Name: 1, dtype: int64

#### loc, iloc
- loc : 라벨 기반 인덱싱, series
- at : row/column label pair 하나의 값에 접근

- iloc : 제로베이스(0부터 시작한다는 어려운 말) 위치기반 인덱싱
- iat : 위치기반 row/column label pair 하나의 값에 접근

In [28]:
df = pd.DataFrame([['a', 'b', 'c'],
                   ['d', 'e', 'f'],
                   ['g', 'h', 'i'],
                   ['j', 'k', 'l'],
                   ],
                   index=['a', 'b', 'c', 'd'],
                   columns = ['A', 'B', 'C']                   
                   )
df

   A  B  C
a  a  b  c
b  d  e  f
c  g  h  i
d  j  k  l

In [30]:
df.loc["a"] # 하나만 적으면 행 우선
type(df.loc["a"])

df.loc[["a"]]
type(df.loc[["a"]])

A    a
B    b
C    c
Name: a, dtype: object

pandas.core.series.Series

   A  B  C
a  a  b  c

pandas.core.frame.DataFrame

In [32]:
df

   A  B  C
a  a  b  c
b  d  e  f
c  g  h  i
d  j  k  l

In [43]:
# a~b행, A~C열 추출
df.loc["a":"b", "A":"C"]
# C행의 모든 열
df.loc[["c"]]
# b, d행의 B~D열 추출
df.loc[["b", "d"], "B":"C"]

   A  B  C
a  a  b  c
b  d  e  f

   A  B  C
c  g  h  i

   B  C
b  e  f
d  k  l

In [44]:
# dict으로 dataframe 만들기
data = {
    '지역':['서울', '부산', '인천', '전주'],
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2000002],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],   
    "2010-2015 증가율":[0.0283, 0.0163, 0.0982,0.0141]
}
# 행방향 인덱스 (index)
index  = ['수도권', '경상권', '수도권', '호남권']
dict_df = pd.DataFrame(data, index=index)
dict_df

     지역     2015     2010     2005     2000  2010-2015 증가율
수도권  서울  9904312  9631482  9762546  9853972         0.0283
경상권  부산  3448737  3393191  3512547  3655437         0.0163
수도권  인천  2890451  2632035  2517680  2466338         0.0982
호남권  전주  2466052  2000002  2456016  2473990         0.0141

In [45]:
dict_df.loc["수도권", "지역":"2000"]

     지역     2015     2010     2005     2000
수도권  서울  9904312  9631482  9762546  9853972
수도권  인천  2890451  2632035  2517680  2466338

#### at

In [54]:
t = dict_df.at["호남권", "2010"]
print(t, type(t))
u = dict_df.at["수도권", "2010"]
# u = dict_df.at["수도권", "2010":"2011"] # at은 슬라이싱 불가, 값만 던져주는
print(u, type(u))

2000002 <class 'numpy.int64'>
수도권    9631482
수도권    2632035
Name: 2010, dtype: int64 <class 'pandas.core.series.Series'>

#### iloc

In [57]:
df
# a~b행, A~C열 추출
df.iloc[0:2, 0:3]
# C행의 모든 열
df.iloc[2]
# b, d행의 B~D열 추출
df.iloc[[1, 3], 1:3]

   A  B  C
a  a  b  c
b  d  e  f
c  g  h  i
d  j  k  l

   A  B  C
a  a  b  c
b  d  e  f

A    g
B    h
C    i
Name: c, dtype: object

   B  C
b  e  f
d  k  l

#### iat

In [59]:
df
df.iat[0, 0]
df.iat[2, 2]

   A  B  C
a  a  b  c
b  d  e  f
c  g  h  i
d  j  k  l

'a'

'i'

#### 타입캐스팅
- numeric
- datetime
- str

In [60]:
num_str = "001230091232"
num = pd.to_numeric(num_str)
num

date_str = "2021-12-04"
date = pd.to_datetime(date_str)
date

str(num)
str(date)

np.int64(1230091232)

Timestamp('2021-12-04 00:00:00')

'1230091232'

'2021-12-04 00:00:00'